In [7]:
import numpy as np
import pandas as pd

# DataFrame - Series

* DataFrame'ler pandas'ta bolca kullanılan bir veri tipi.

* DataFrame'i anlamak için önce python dictionary'lerinden başlayalım, onlara çok benziyor

In [2]:
people = {
    "name": ["Finley", "Andrew", "Blake"],
    "last_name": ["Brown", "Bradley", "Hughes"],
    "age": [23,21,34]
         
}

In [3]:
people

{'name': ['Finley', 'Andrew', 'Blake'],
 'last_name': ['Brown', 'Bradley', 'Hughes'],
 'age': [23, 21, 34]}

In [6]:
people["name"]

['Finley', 'Andrew', 'Blake']

In [5]:
type(people)

dict

## Dictionary'lerden DataFrame Oluşturmak

In [6]:
a = np.array([1,2,3])
a

array([1, 2, 3])

In [8]:
df = pd.DataFrame(people)

In [6]:
df

     name last_name  age
0  Finley     Brown   23
1  Andrew   Bradley   21
2   Blake    Hughes   34

In [45]:
df["name"]

0    Finley
1    Andrew
2     Blake
Name: name, dtype: object

* Dictionary'nin keyleri column isimleri, value'ları da column'un değerleri olmuş oldu

In [22]:
type(df)

pandas.core.frame.DataFrame

In [23]:
df.shape

(3, 3)

## DataFrame'in Column(sütun)'larına Erişmek

* Key değerleri ile dictionary'lerin value'larına erişebiliyorduk:

In [7]:
people

{'name': ['Finley', 'Andrew', 'Blake'],
 'last_name': ['Brown', 'Bradley', 'Hughes'],
 'age': [23, 21, 34]}

In [8]:
people["last_name"]

['Brown', 'Bradley', 'Hughes']

* DataFrame ile dictionary çok benziyor demiştim, DataFrame'in column değerlerine ulaşmak için de aynı şekilde yapabiliyoruz:

In [8]:
df

     name last_name  age
0  Finley     Brown   23
1  Andrew   Bradley   21
2   Blake    Hughes   34

In [9]:
df["last_name"]

0      Brown
1    Bradley
2     Hughes
Name: last_name, dtype: object

* hmm ama farklı bir yapıda döndü sanki?

In [10]:
type(df["last_name"])

pandas.core.series.Series

* Series veri tipinde döndü. Bu da pandas'ın bir veri tipi. listler veya numpy'daki array'ler gibi düşünebilirsiniz. Farklı farklı değerleri bir arada tutan bir konteynır gibi.

* **Birden çok Series bir araya gelip DataFrame** oluşturdu. DataFrame'leri Series objelerini bir arada tutan bir konteynır gibi düşünebiliriz. Genellikle birden çok Series objesi döndürüleceği zaman zaten output tipi DataFrame oluyor olacak

* DataFrame'in içerisindeki row (satır)'lar da column (sütun)'lar da Series olarak düşünülebilir.

* Column'un değerlerine şu şekilde de ulaşabiliyoruz:

In [11]:
df.last_name

0      Brown
1    Bradley
2     Hughes
Name: last_name, dtype: object

In [48]:
people2 = {
    "name": ["Finley", "Andrew", "Blake"],
    "last_name": ["Brown", "Bradley", "Hughes"],
    "age": [23,21,34],
    "add": [1,2,3]
         
}

In [49]:
df2 = pd.DataFrame(people2)

In [50]:
df2

     name last_name  age  add
0  Finley     Brown   23    1
1  Andrew   Bradley   21    2
2   Blake    Hughes   34    3

In [54]:
df2["add"]

0    1
1    2
2    3
Name: add, dtype: int64

In [52]:
df2.add

<bound method _arith_method_FRAME.<locals>.f of      name last_name  age  add
0  Finley     Brown   23    1
1  Andrew   Bradley   21    2
2   Blake    Hughes   34    3>

In [53]:
df2.name

0    Finley
1    Andrew
2     Blake
Name: name, dtype: object

In [46]:
df.name

0    Finley
1    Andrew
2     Blake
Name: name, dtype: object

In [47]:
df["name"]

0    Finley
1    Andrew
2     Blake
Name: name, dtype: object

## Read Csv

In [74]:
df = pd.read_csv("data/student.csv")

In [75]:
df

     name last_name  age
0  Finley     Brown   23
1  Andrew   Bradley   21
2   Blake    Hughes   34

In [15]:
df2 = pd.read_csv("data/student2.csv")

In [16]:
df2

  name;last_name;age
0    Finley;Brown;23
1  Andrew;Bradley;21
2    Blake;Hughes;34

In [17]:
df2.columns

Index(['name;last_name;age'], dtype='object')

In [82]:
df2["name"]

KeyError: 'name'

In [83]:
df2["name;last_name;age"]

0      Finley;Brown;23
1    Andrew;Bradley;21
2      Blake;Hughes;34
Name: name;last_name;age, dtype: object

In [84]:
df3 = pd.read_csv("data/student2.csv",sep=";")

In [85]:
df3

     name last_name  age
0  Finley     Brown   23
1  Andrew   Bradley   21
2   Blake    Hughes   34

In [14]:
"portakal, elma, kavun"

'portakal, elma, kavun'

In [3]:
"portakal;elma;kavun".split(",")

['portakal;elma;kavun']

In [17]:
"portakal;elma;kavun".split(";")

['portakal', 'elma', 'kavun']